{"queue":[{"user":"184011968946896896","submitted":1751006654,"kind":"amd_admin","active":true,"votemsg":"1388048981103218768","startdate":1751007065,"enddate":"","eligiblevoters":["184011968946896896"],"subject":"Nearing burnout","summary":"This resolution proposes that a peer_queue channel be added to this discord server, containing a publicly visible queue which displays resolution \"headers\": those message blocks which contain only the respective class, subject, and author, which we have already been using. These headers would serve to represent resolutions in the queue, without the entire resolution needing to be posted there.\n\nThe author reasons that since Peer Resolutions already cannot be posted at just any time (due to eg. the current rules forbidding us from running two at once), there should then be a queue system in place in order to prevent some pending Peer Resolutions from being unfairly delayed more than others.\n\nThe queue would run first-in-first-out: a Peer would submit their Peer Resolution to the Chair in order to have its header added onto the bottom of the queue, and any header at the top of the queue would be removed once the Peer Resolution tied to it had been started.\n\nIn order to prevent filibustering of the queue system, each Peer would be limited to having at most one header in the queue at a time. If there was already a header in the queue for which the Peer was listed as author, they would be unable to submit another Peer Resolution until their already pending one had been either withdrawn from peer_queue or started in <1374970875299893290.\n\nThis, with one exception: Applications for Membership and Applications for Peerage would not count against the Chair's limit of one — along with being obligatorily authored by the Chair (which would unfairly deprive the Chair of their own submission opportunities), these are safe from filibustering because they cannot be submitted unless there is a previously removed applicant or candidate presenting themselves for consideration.\n\nFinally, this resolution proposes that the <1374970875299893290 channel be restricted to messages sent by the Chair alone. The author reasons that — supposing the previous points of this resolution were agreed to — we would already have effectively forbidden Peers from sending any message there the vast majority of the time. Rather than obligate Peers to post only when the timing is precisely right and remain silent otherwise, and rather than obligate the Chair to chase violations and constantly supervise the channel, it would perhaps be better for Peer Resolutions to just be posted by the individual charged with managing the queue.\n\nTo prevent the Chair from abusing this, we would make it an obligation for them to to format any Peer Resolution within 72 hours of submission, in private consultation with its respective author, as well as post its header to the queue right afterwards. We would also obligate that they start the next resolution immediately upon the release of the previous resolution's final tally, to prevent any needless delays in the voting system.","details":"II. Definitions\n\n+ Class     : the general topic of a Peer Resolution, which describes what kind of\n+             resolution it is.\n+\n+ Subject   : the specific topic of a Peer Resolution, which gives a name to the\n+             exact circumstance being addressed.\n+\n+ Threshold : the proportion of non-abstaining Peers that must support a given Peer\n+             Resolution in order for it to pass.\n+\n+ Header    : a message; the first part of a Peer Resolution, which contains the\n+             class, subject, and author. It also contains the initial ping if the\n+             Peer Resolution has been started.\n+\n+ Body      : a message; the second part of a Peer Resolution, which contains its\n+             details.\n+\n+ Footer    : a message; the third part of a Peer Resolution, which contains the\n+             threshold. It also contains the voting options if the Peer Resolution\n+             has been started.\nIII. Procedures\n1. Peer Resolutions\n \n+ The Chair must format every submitted proposal within 72 hours of its submission, in consultation with the author. The author must be present and must respond to the consultation requests in order to complete the submission.\n+\n+ During the course of formatting, the Chair may recommend significant changes to a proposal, but only if the author indicates they are willing to hear them. Before the proposal can be entered into the queue, the author must first approve the body of the formatted document for publication. If the author insists upon it, the Chair must accept the body for publication verbatim, with only general style formatting applied.\n+\n+ The \\peer_resolutions channel shall be a publicly visible voting floor for Peer Resolutions.\n+ • Only the Peers may use voting reactions.\n+ • Only the Chair may send messages.\n+ • The only messages shall be Peer Resolutions and their final tallies.\n+\n+ The peer_queue channel shall be a publicly visible queue for Peer Resolutions.\n+ • The queue will run first-in-first-out.\n+ • Only the Chair may send messages.\n+ • The only messages shall be headers of Peer Resolutions.\n+ All Peers shall be limited to having at most one header in the queue at a time, with the exception of Applications for Membership and Applications for Peerage which shall not count.\nPrerequisites\n+ • A proposal must first be sent to the Chair for formatting.\n+ • The author must first approve of all changes made to the body during formatting.\n+ • There must first be no other Peer Resolution ahead of it in the queue.\nObligations\n- • Whoever ends the Peer Resolution shall post a summary of the outcome, called the “final tally”.\n+ • The Chair shall post a summary of the outcome, called the “final tally”.\nIV. Positions\n1. Chair\n Powers\n+ • May recommend changes to a submitted Peer Resolution, with the permission of the author.\n+ • May submit a Peer Resolution to the queue, regardless of any Applications for Membership or Applications for Peerage of theirs already in the queue.\nObligations\n+ • Must format Peer Resolutions within 72 hours of submission, in consultation with the author.\n+ • Must immediately add Peer Resolutions to the queue once formatting has completed.\n+ • Must withdraw Peer Resolutions from the queue at the author's request.\n+ • Must start Peer Resolutions with the initial ping.\n+ • Must immediately remove Peer Resolutions from the queue once started.\n- • Must close Peer Resolutions with the final tally, if the author has not done so already.\n+ • Must end Peer Resolutions with the final tally.\n- • Must upkeep the operations of the peerage.\n+ • Must immediately start the next Peer Resolution in queue once the current Peer Resolution has ended.2. Peer\nPowers\n- • May close Peer Resolutions they have authored, with the final tally.\n+ • May submit a Peer Resolution to the Chair for formatting and queueing, provided that there is not already another Peer Resolution of theirs in the queue.\n+ • May insist that their own Peer Resolution be published verbatim, with only general formatting.\n+ • May choose to withdraw their own Peer Resolution from the queue.\nObligations\n+ • Must respond to consultation requests during Peer Resolution submission."}]}